"""
Задание 1.

Каждое из слов «разработка», «сокет», «декоратор» представить
в буквенном формате и проверить тип и содержание соответствующих переменных.
Затем с помощью онлайн-конвертера преобразовать
в набор кодовых точек Unicode (НО НЕ В БАЙТЫ!!!)
и также проверить тип и содержимое переменных.

*Попытайтесь получить кодовые точки без онлайн-конвертера!
без хардкода!

Подсказки:
--- 'разработка' - буквенный формат
--- '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430' - набор кодовых точек
--- используйте списки и циклы, не дублируйте функции
"""


def str_format(list_word):
    for i in list_word:
        print(f'"{i}", формат кодовых точек - {ascii(i)},'
              f' тип кодовых точек - {type(ascii(i))}.')


word_list = ['разработка', 'сокет', 'декоратор']

if __name__ == '__main__':
    str_format(word_list)
